[[ https://habrastorage.org/r/w1560/webt/qc/c3/a4/qcc3a4rodwv0ugt0g3itdldajda.jpeg ]]

Темный квадрат в таблице на пересечении линий «полимер»-«растворитель», говорит о том, что химическую сварку с использованием данных компонентов провести представляется возможным. Примечание: квадратик на пересечении «ABS»-«ацетон» — с буквой H, потому что именно хабра-сообщество убедило меня в том, что ABS клеит в основном ацетоном (у меня ацетон растворял ABS, но потом склеить этим раствором ничего не получалось, ибо крошился).

Если с вопросом наличия пластика проблем, как правило, не возникает, то достаточно часто возникает проблема с наличием нужного растворителя. Каждый выкручивается в меру своих возможностей — кто-то просто заказывает необходимые растворители, кто-то ищет их на блошином рынке, ну а кто-то пытается эмпирическим методом подобрать из того, что продается в магазинах. Под спойлером, если что, состав имеющихся в продаже растворителей для лаков и красок (взято с chemister).

Растворители:

Растворитель 645: толуол 50%, бутилацетат 18%, этилацетат 12%, бутанол 10%, этанол 10%.
Растворитель 646: толуол 50%, этанол 15%, бутилацетат (или амилацетат) 10%, бутанол 10%, этилцеллозольв 8%, ацетон 7%.
Растворитель 647: толуол (или пиробензол) 41,3%, бутилацетат (или амилацетат) 29,8%, этилацетат 21,2%, бутанол 7,7%.
Растворитель 648: бутилацетат 50%, толуол 20%, бутанол 20%, этанол 10%.
Растворитель 649: ксилол 50%, этилцеллозольв 30%, изобутанол 20%.
Растворитель 650: ксилол 50%, бутанол 30%, этилцеллозольв 20%.
Растворитель 651: уайт-спирит 90%, бутанол 10%.
Растворитель КР-36: бутанол 80%, бутилацетат 20%.
Растворитель Р-4: толуол 62%, ацетон 26%, бутилацетат 12%.
Растворитель Р-10: ксилол 85%, ацетон 15%.
Растворитель Р-12: толуол 60%, бутилацетат 30%, ксилол 10%.
Растворитель Р-14: циклогексанон 50%, толуол 50%.
Растворитель Р-24: сольвент 50%, ксилол 35%, ацетон 15%.
Растворитель Р-40: толуол 50%, этилцеллозольв 30%, ацетон 20%.
Растворитель Р-219: толуол 34%, циклогексанон 33%, ацетон 33%.
Растворитель Р-3160: бутанол 60%, этанол 40%.
Растворитель РКЧ: ксилол 90%, бутилацетат 10%.
Растворитель РМЛ: этанол 64%, этилцеллозольв 16%, толуол 10%, бутанол 10%.
Растворитель РМЛ-315: толуол 25%, ксилол 25%, бутилацетат 18%, этилцеллозольв 17%, бутанол 15%.
Растворитель РС-1: толуол 60%, бутилацетат 30%, ксилол 10%.
Растворитель РС-2: уайт-спирит 70%, ксилол 30%.
Растворитель РФГ: этанол 75%, бутанол 25%.
Растворитель РЭ-1: ксилол 50%, ацетон 20%, бутанол 15%, этанол 15%.
Растворитель РЭ-2: сольвент 70%, этанол 20%, ацетон 10%.
Растворитель РЭ-3: сольвент 50%, этанол 20%, ацетон 20%, этилцеллозольв 10%.
Растворитель РЭ-4: сольвент 50%, ацетон 30%, этанол 20%.
Растворитель ФК-1 (?): абсолютированный спирт (99,8%) 95%, этилацетат 5%

Разбавители:

Разбавитель для водоразбавленных лаков и красок: бутанол 62%, бутилцеллозольв 38%.
Разбавитель М: этанол 65%, бутилацетат 30%, этилацетат 5%.
Разбавитель Р-7: циклогексанон 50%, этанол 50%.
Разбавитель Р-197: ксилол 60%, бутилацетат 20%, этилцеллозольв 20%.
Разбавитель РДВ: толуол 50%, бутилацетат (или амилацетат) 18%, бутанол 10%, этанол 10%, этилацетат 9%, ацетон 3%.
Разбавитель РКБ-1: ксилол 50%, бутанол 50%.
Разбавитель РКБ-2: бутанол 95%, ксилол 5%.
Разбавитель РКБ-3: ксилол 90%, бутанол 10%.

Разбавители для электрокраски:

Разбавитель РЭ-1В: сольвент 70%, бутанол 20%, диацетоновый спирт 10%.
Разбавитель РЭ-2В: сольвент 60%, бутилацетат 20%, этилцеллозольв 20%.
Разбавитель РЭ-3В: сольвент 50%, бутанол 30%, этилцеллозольв 20%.
Разбавитель РЭ-4В: этилцеллозольв 50%, сольвент 50%.
Разбавитель РЭ-5В: ксилол 40%, циклогексанон 25%, этилцеллозольв 25%, бутанол 10%.
Разбавитель РЭ-6В: сольвент 50%, ксилол 35%, диацетоновый спирт 15%.
Разбавитель РЭ-7В: ксилол 60%, бутилацетат 25%, диацетоновый спирт 10%, циклогексанон 5%.
Разбавитель РЭ-8В: бутанол 75%, ксилол 25%.
Разбавитель РЭ-9В: сольвент 50%, бутилацетат 30%, этилцеллозольв 20%.
Разбавитель РЭ-10В: сольвент 40%, бутанол 40%, этилцеллозольв 20%.
Разбавитель РЭ-11В: ксилол 40%, этилцеллозольв 30%, бутилацетат 20%, циклогексанон 10%.

Разжижители:

Разжижитель ДМЗ-Р: бутилацетат (или амилацетат) 39%, толуол 30%, этилацетат 16%, ацетон 15%.
Разжижитель Р-5: ксилол 40%, бутилацетат 30%, ацетон 30%.
Разжижитель Р-6: пиробензол 40%, этанол 30%, бутанол 15%, бутилацетат 15%.
Разжижитель Р-60: этанол 70%, этилцеллозольв 30%.
Разжижитель РВЛ: хлорбензол 50%, этилцеллозольв 50%. 

На заметку: добавлю от себя пару слов про полимеры, не попавшие в таблицу. Конечно же это любимый «народный» филамент — PLA, который растворяется лучше всего в полярных апротонных растворителях: пиридин, N-метилпирролидон, этилацетат, пропиленкарбонат, диоксалан, диоксан, дихлорметан, хлороформ, ацетон (??-зависит от производителя PLA-филамента и содержащихся внутри «присадок», это же актуально и для других полимеров), нитробензол, ацетонитрил, диметилацетамид и т.д. Перспективный 3D полимер PEEK (он же полиэфиркетон) замечательно растворяется в 4-хлорфеноле (более жесткий вариант — смесь 80% хлороформа и 20% дихлоруксусной кислоты). Хлорфенолами (не только 4-, но и 2-хлорфенолом) можно растворить также и широко распространенный и горяче любимый PET. По просьбам читателей, упомяну и достаточно новый полимер PET-ряда, так называемый PETG (полиэтилентерефталат-гликоль). Как и старший брат, этот полимер устойчив к ряду доступных широко используемых компонентов, растворяется только в HFIP (гексафторпропанол). Мягкий и податливый TPU (термопластичный полиуретан), как и другие полиуретаны можно растворить в N,N-диметилформамиде (ДМФА), тетрагидрофуране, этилацетате, циклогексаноне, диметилацетамиде. Кстати, монтажная пена, это тоже полиуретан. Не смотрел что находится в составе специальных жидкостей для промывки пистолетов для монтажной пены, но подозреваю, что какой-то из упомянутых компонентов там точно есть. Полимер PCL (поликапролактон) растворяется в анизоле, 2,2,2-трифторэтаноле, N,N-диметилформамиде, метилпирролидоне, тетрагидрофуране, дихлорметане, ацетоне, хлороформе и ДМСО (диметилсульфоксид, он же продающийся в аптеке «Димексид»). PDMS (полидиметилсилоксан) широко используемый для прототипирования (особенно в научных учреждениях, имеющих отношение к микро- и нанофлюидике) растворяется с помощью ледяной уксусной кислоты. Кстати, подобными свойствами обладают и многие другие силиконы, начиная от строительного двухкомпонентного, и заканчивая теми, на которые клеят стикеры с ценами (поэтому смыть остатки клея от ценника с ABS пластика, например, продуктивнее всего получится с использованием какой-нибудь уксусной эссенции). Ну и в завершение немного экзотики. EVA (этиленвинилацетат), PP (полипропилен), PE (полиэтилен, LD/HD) растворяются в 1,2,4-трихлорбензоле, а PVP (поливинилпирролидон) — в диметилацетамиде.

Техника безопасности при работе с растворителями

Так как растворители, мягко говоря, это вам не аромат цветущей сакуры, то и вопрос техники безопасности при работе с ними на повестке дня имеется. Печально наблюдать, как молодые ребята без всяких средств защиты иногда работают кто с ацетоном, кто с хлороформом, а кто-то даже с бензолом. А правила ТБ, они, как известно, «писаны кровью»…

Основные пути попадания растворителей в организм человека (и их паров) — через органы дыхания и через кожные покровы. Всякие девиации (вроде приема внутрь) я не рассмартиваю, потому как человек в здравом уме никогда не будет пить бензол. Упомянутые реагенты обладают преимущественно наркотическим действием, оказывают выраженное раздражающее действие на слизистые оболочки верхних дыхательных путей и конъюнктиву глаза, умеренное — на кожу. Лучшая защита от них — работать в условиях приточно-вытяжной вентиляции, в специальных боксах. Если дело происходит в специализированных мастерских или лабораториях, то чаще всего там уже есть вытяжной шкаф.

Если невозможно устроить необходимую вентиляцию, работающих с органическими растворителями снабжают средствами индивидуальной защиты: респираторами, противогазами, кислородно-изолирующими приборами и т.п. (в зависимости от концентрации паров). В целом, пары растворителей замечательно сорбируются активированным углем (и многими другими сорбентами) недаром раньше некоторые растворители активно использовались для оценки сорбционной способности материала (т.н. «эксикаторный метод»). Я лично «имел честь» проверять сорбционную способность углей по поглощению ими тетрахлорметана CCl4. Большую часть паров сможет задержать противогаз с коробкой класса А или маска-респиратор с аналогичным фильтрующим патроном. Вроде такой:

Важно в описании искать что-то вроде "защищает от паров органических соединений (бензин, керосин, ацетон, бензол и его гомо­логи, ксилол, сероуглерод и др.), фосфор- и хлорорганических ядохимикатов, пыли, дыма, тумана". Но к такой маске желательно еще и герметичные очки, стекла которых от запотевания натерты раствором, в состав которого входит желатин, сахар и вода в соотношении 2:20:50. Лучше конечно при наличии денег сразу взять какой-нибудь противогаз промышленный фильтрующий или маску защитную панорамную и убить двух зайцев (=сэкономить на очках)


Растворители. ПДК&воздействие на организм

[[ https://habrastorage.org/r/w1560/webt/mg/nq/iq/mgnqiqhtibz8rqznqx75tnwmsv4.jpeg ]]
